questions = [
    {
        'question': 'Что вы цените в себе больше всего?',
        'options': ['Хитрость', 'Терпеливость', 'Силу', 'Спокойствие', 'Игривость', 'Лидерство'],
        'animal_mapping': {
            'Хитрость': ['Фенек'],
            'Терпеливость': ['Малый лори', 'Большая панда'],
            'Силу': ['Камышовый кот'],
            'Спокойствие': ['Даман Брюса'],
            'Игривость': ['Бинтуронг'],
            'Лидерство': ['Индийский лев']
        }
    },
    {
        'question': 'Где вам комфортнее находиться?',
        'options': ['В одиночестве', 'В кругу друзей'],
        'animal_mapping': {
            'В одиночестве': ['Камышовый кот', 'Малый лори', 'Большая панда'],  
            'В кругу друзей': ['Фенек', 'Бинтуронг', 'Индийский лев', 'Даман Брюса'] 
        }
    },
    {
        'question': 'Какой пейзаж вам ближе?',
        'options': ['Пустынный', 'Лесной', 'Горный', 'Равнинный'],
        'animal_mapping': {
            'Пустынный': ['Фенек'],
            'Лесной': ['Малый лори', 'Бинтуронг', 'Камышовый кот', 'Большая панда'],
            'Горный': ['Даман Брюса'],
            'Равнинный': ['Индийский лев']
        }
    },
    {
        'question': 'Как вы проводите свободное время?',
        'options': ['Сплю', 'Играю', 'Медитирую', 'Путешествую', 'Охочусь'],
        'animal_mapping': {
            'Сплю': ['Малый лори', 'Большая панда'],
            'Играю': ['Бинтуронг'],
            'Медитирую': ['Даман Брюса'],
            'Путешествую': ['Фенек'],
            'Охочусь': ['Камышовый кот', 'Индийский лев']
        }
    },
    {
        'question': 'Когда вы наиболее активны?',
        'options': ['Утром', 'Днем', 'Вечером', 'Ночью'],
        'animal_mapping': {
            'Утром': ['Фенек', 'Индийский лев', 'Большая панда'],
            'Днем': ['Бинтуронг', 'Даман Брюса'],
            'Вечером': ['Камышовый кот'],
            'Ночью': ['Малый лори']  
        }
    },
    {
        'question': 'Как бы вы предпочли передвигаться?',
        'options': ['Бегать', 'Ползать', 'Прыгать', 'Ходить'],
        'animal_mapping': {
            'Бегать': ['Фенек', 'Камышовый кот'],
            'Ползать': ['Малый лори'],
            'Прыгать': ['Бинтуронг'],
            'Ходить': ['Даман Брюса', 'Индийский лев', 'Большая панда']
        }
    },
    {
        'question': 'Какой климат вам подходит больше?',
        'options': ['Жаркий', 'Теплый', 'Прохладный'],
        'animal_mapping': {
            'Жаркий': ['Фенек', 'Индийский лев'],
            'Теплый': ['Бинтуронг', 'Камышовый кот', 'Малый лори'],
            'Прохладный': ['Даман Брюса', 'Большая панда']
        }
    },
    {
        'question': 'Что вы бы предпочли съесть?',
        'options': ['Фрукты', 'Мясо', 'Рыбу', 'Насекомых'],
        'animal_mapping': {
            'Фрукты': ['Бинтуронг', 'Малый лори', 'Большая панда'],
            'Мясо': ['Камышовый кот', 'Индийский лев'],
            'Рыбу': ['Камышовый кот'], 
            'Насекомых': ['Фенек']
        }
    },
    {
        'question': 'Какую музыку вы любите?',
        'options': ['Ритмичную', 'Спокойную', 'Динамичную', 'Мелодичную'],
        'animal_mapping': {
            'Ритмичную': ['Фенек'],
            'Спокойную': ['Малый лори', 'Большая панда'], 
            'Динамичную': ['Индийский лев', 'Камышовый кот'], 
            'Мелодичную': ['Даман Брюса'], 
            'Танцевальную': ['Бинтуронг']
        }
    }
]


